let PhishingFeed =
externaldata(Date:string, Domain:string)
[
  @"https://raw.githubusercontent.com/CyberArk0961/Phishing-Domains/refs/heads/main/output/daily_phishing_domains.csv"
]
with (format="csv", ignoreFirstRecord=true)
| extend DomainLower = tolower(Domain);
DeviceNetworkEvents
| where Timestamp > ago(7d)
| extend UrlDomain = tolower(tostring(parse_url(RemoteUrl).Host))
| join kind=inner (
    PhishingFeed
) on $left.UrlDomain == $right.DomainLower
| project
    Timestamp,
    DeviceName,
    RemoteUrl,
    UrlDomain,
    InitiatingProcessFileName,
    ActionType,
    ReportId,
    DetectionSource = "Matched Phishing Domain"
| sort by Timestamp desc




error:Error message
Couldn't generate results because query execution exceeded the memory consumption limit. This limit applies to the total memory consumed during execution, including intermediate results, joins, and data transformations.
How to resolve
