let PhishingDomains =
ThreatIntelligenceIndicator
| where Source == "CyberArk0961-Phishing"
| where IndicatorType == "DomainName"
| summarize DomainSet = make_set(tolower(IndicatorValue));

DeviceNetworkEvents
| extend Domain = tolower(tostring(parse_url(RemoteUrl).Host))
| where Domain has_any (DomainSet)
| project Timestamp, DeviceName, RemoteUrl, InitiatingProcessFileName
| order by Timestamp desc

EmailUrlInfo
| extend Domain = tolower(UrlDomain)
| where Domain has_any (DomainSet)
| project Timestamp, RecipientEmailAddress, Url, DeliveryAction
